# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
#Your code here

import sqlite3
import pandas as pd

conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [19]:
#Your code here

cur.execute('''SELECT firstname, lastname, city FROM employees
join offices
using(officeCode)
WHERE city = 'Boston';
''')

df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df

  firstName   lastName    city
0     Julie   Firrelli  Boston
1     Steve  Patterson  Boston

## Do any offices have no employees?

In [8]:
#Your code here
cur.execute('''SELECT city, count(*) FROM offices
join employees
using(officeCode)
GROUP BY 1''')
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df

            city  count(*)
0         Boston         2
1         London         2
2            NYC         2
3          Paris         5
4  San Francisco         6
5         Sydney         4
6          Tokyo         2

## Level Up: Display the names of each product each employee has sold.

In [14]:
# Your code here
cur.execute("""SELECT firstname, lastname, count(productname) FROM employees e
join customers c on e.employeenumber=c.salesrepemployeenumber
join orders o using(customernumber)
join orderdetails using(ordernumber)
join products using(productcode)
GROUP BY employeenumber
""")
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df

   firstName   lastName  count(productname)
0     Leslie   Jennings                 331
1     Leslie   Thompson                 114
2      Julie   Firrelli                 124
3      Steve  Patterson                 152
4   Foon Yue      Tseng                 142
5     George     Vanauf                 211
6       Loui     Bondur                 177
7     Gerard  Hernandez                 396
8     Pamela   Castillo                 272
9      Larry       Bott                 236
10     Barry      Jones                 220
11      Andy     Fixter                 185
12     Peter      Marsh                 185
13      Mami      Nishi                 137
14    Martin     Gerard                 114

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!